In [1]:
import pandas as pd

In [2]:
data = [4,8,15,16,23,42]

In [3]:
series = pd.Series(data)

In [4]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
type(series)

pandas.core.series.Series

In [7]:
data1 = [1,2,3,4,5,6,7,8,9,10]

In [8]:
series1= pd.Series(data1)

In [9]:
series1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [10]:
data2 = {"name":["Alice","Bob","Chaire"],
         "age":[25,30,27],
         "gender":["Female","Male","Female"]}

In [11]:
df = pd.DataFrame(data2)

In [12]:
df

     name  age  gender
0   Alice   25  Female
1     Bob   30    Male
2  Chaire   27  Female

-> DataFrame is two dimensional size -mutable, tabular data structure with labeled axes (rows and columns)
-> Series is a one dimensional labbeled array capable of holding any data type (integer, float, string)

In [14]:
series_ex = pd.Series([1,2,3,4,5,6,7,8])
series_ex

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [15]:
dataframe_ex = pd.DataFrame({"a" : [1,2,3,4], "b" : [5,6,7,8]})

In [18]:
dataframe_ex

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

Pandas has wide range of functions to manipulate data in DataFRame. Some common function include 

-> head() and tail() : use to to vies first or last n rows of a DataFrame. 
-> describe() : Generates descriptive statistics for the DataFrame , including count, mean, standard deviation, minimum , maximum and quartiles.
-> groupby() : use to group rows in a DataFrame based on one or more columns , and apply function to easch group.
-> sort_values() : use to sort values in ascending order or decending order. 
-> drop() : removes one or more rows or columns from the DataFrame.

In [19]:
df1 = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [21]:
df1.head() # by default it read first 5 rows if no rows is not specified

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
df1.tail() # by default it read last 5 rows if no rows is not specified

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q